**PANDAS KÜTÜPHANESİNE GİRİŞ**

**PANDAS SERİSİ OLUŞTURMA**

In [15]:
import pandas as pd

In [16]:
 pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : ca60aab7340d9989d9428e11a51467658190bb6b
python           : 3.9.13.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.22621
machine          : AMD64
processor        : AMD64 Family 23 Model 24 Stepping 1, AuthenticAMD
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : Turkish_Turkey.1254

pandas           : 1.4.4
numpy            : 1.21.5
pytz             : 2022.1
dateutil         : 2.8.2
setuptools       : 63.4.1
pip              : 22.2.2
Cython           : 0.29.32
pytest           : 7.1.2
hypothesis       : None
sphinx           : 5.0.2
blosc            : None
feather          : None
xlsxwriter       : 3.0.3
lxml.etree       : 4.9.1
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 2.11.3
IPython          : 7.31.1
pandas_datareader: 0.10.0
bs4              : 4.11.1
bottleneck       : 1.3.5
brotli           :
fastparquet      : None
fsspec           : 2022.7.1
gcsfs            : None
markupsafe       : 2.0.1
matplotlib       : 3.5.2
numba            : 0.55.1
numexpr          : 2.8.3
odfpy            : None
openpyxl         : 3.0.10
pandas_gbq       : None
pyarrow          : None
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : 1.9.1
snappy           :
sqlalchemy       : 1.4.39
tables           : 3.6.1
tabulate         : 0.8.10
xarray           : 0.20.1
xlrd             : 2.0.1
xlwt             : None
zstandard        : None

In [17]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [18]:
seri=pd.Series([10,88,3,4,5])

In [19]:
type(seri)

pandas.core.series.Series

In [20]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [21]:
seri.dtype

dtype('int64')

In [22]:
seri.size

5

In [23]:
seri.ndim

1

In [24]:
seri.values

array([10, 88,  3,  4,  5], dtype=int64)

In [25]:
seri.head()

0    10
1    88
2     3
3     4
4     5
dtype: int64

In [26]:
seri.head(3)

0    10
1    88
2     3
dtype: int64

In [27]:
seri.tail(3)

2    3
3    4
4    5
dtype: int64

In [28]:
#index isimlendirmesi

In [29]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [30]:
pd.Series([1,2,3,4,5], index=[1,3,5,7,9])

1    1
3    2
5    3
7    4
9    5
dtype: int64

In [31]:
seri = pd.Series([1,2,3,4,5], index=["a","b","c","d","e"])

In [32]:
seri["b"]

2

In [33]:
seri["a":"c"]

a    1
b    2
c    3
dtype: int64

In [34]:
#sözlük üzerinden liste oluşturmak

In [35]:
sozluk = pd.Series({"reg":10,"log":11,"cart":12})
sozluk

reg     10
log     11
cart    12
dtype: int64

In [36]:
new_dict = {"a":1,"b":2,"c":3}

In [37]:
new_seri = pd.Series(new_dict)

In [38]:
new_seri

a    1
b    2
c    3
dtype: int64

In [39]:
#iki seriyi birleştirerek oluşturmak

In [40]:
pd.concat([sozluk,new_seri])

reg     10
log     11
cart    12
a        1
b        2
c        3
dtype: int64

**Eleman İşlemleri**

In [41]:
import numpy as np

In [42]:
a=np.array([1,2,3,4,5])

In [43]:
seri=pd.Series(a)
seri

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [44]:
seri[0]

1

In [45]:
seri[0:3]

0    1
1    2
2    3
dtype: int32

In [46]:
seri=pd.Series([1,2,3,4], index=["reg","log","cart","rf"])
seri

reg     1
log     2
cart    3
rf      4
dtype: int64

In [47]:
seri.index

Index(['reg', 'log', 'cart', 'rf'], dtype='object')

In [48]:
seri.keys

<bound method Series.keys of reg     1
log     2
cart    3
rf      4
dtype: int64>

In [49]:
list(seri.items())

[('reg', 1), ('log', 2), ('cart', 3), ('rf', 4)]

In [50]:
list(seri.values)

[1, 2, 3, 4]

In [51]:
seri.values

array([1, 2, 3, 4], dtype=int64)

In [52]:
#eleman sorgulama

In [53]:
"reg"in seri

True

In [54]:
"a" in seri

False

In [55]:
seri["reg"]

1

In [56]:
#fancy eleman

In [57]:
seri[["reg","rf"]]

reg    1
rf     4
dtype: int64

In [58]:
seri["reg"]=5

In [59]:
seri["reg"]

5

In [60]:
seri["reg":"log"]

reg    5
log    2
dtype: int64

**Pandas DataFrame Oluşturma**

In [61]:
import pandas as pd

In [62]:
liste=[1,2,34,55,64]
liste

[1, 2, 34, 55, 64]

In [63]:
pd.DataFrame(liste, columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             34
3             55
4             64

In [64]:
import numpy as np

In [65]:
a=np.arange(1,10).reshape((3,3))
a

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [66]:
pd.DataFrame(a ,columns=["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [67]:
#df isimlendirme

In [68]:
df=pd.DataFrame(a ,columns=["var1","var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [69]:
df.columns=("deg1","deg2","deg3")
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [70]:
type(df)

pandas.core.frame.DataFrame

In [71]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [72]:
df.shape

(3, 3)

In [73]:
df.ndim

2

In [74]:
df.size

9

In [75]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [76]:
type(df.values)

numpy.ndarray

In [77]:
a=np.array([1,2,3,4,5])

In [78]:
pd.DataFrame(a, columns=["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

**Pandas DataFrame Eleman İşlemleri**

In [79]:
import numpy as np

In [80]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

In [81]:
sozluk={"var1":s1,"var2":s2,"var3":s3}

In [82]:
sozluk

{'var1': array([5, 5, 6, 6, 6]),
 'var2': array([3, 1, 3, 5, 6]),
 'var3': array([2, 1, 2, 8, 6])}

In [85]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     5     3     2
1     5     1     1
2     6     3     2
3     6     5     8
4     6     6     6

In [86]:
df[0:1]

   var1  var2  var3
0     5     3     2

In [87]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [88]:
df.index=["a","b","c","d","e"]

In [89]:
df

   var1  var2  var3
a     5     3     2
b     5     1     1
c     6     3     2
d     6     5     8
e     6     6     6

In [90]:
df["c":"e"]

   var1  var2  var3
c     6     3     2
d     6     5     8
e     6     6     6

In [203]:
#silme işlemleri

In [92]:
df.drop("a",axis=0)

   var1  var2  var3
b     5     1     1
c     6     3     2
d     6     5     8
e     6     6     6

In [93]:
df.drop("a",axis=0,inplace=True)

In [94]:
df

   var1  var2  var3
b     5     1     1
c     6     3     2
d     6     5     8
e     6     6     6

In [204]:
#fancy ile silme işlemleri

In [96]:
l=["c","e"]

In [97]:
df.drop(l,axis=0)

   var1  var2  var3
b     5     1     1
d     6     5     8

In [99]:
df

   var1  var2  var3
b     5     1     1
c     6     3     2
d     6     5     8
e     6     6     6

In [100]:
"var1" in df

True

In [101]:
l=["var1","var4","var2"]

In [103]:
for i in l:
    print (i in df)

True
False
True

In [104]:
df

   var1  var2  var3
b     5     1     1
c     6     3     2
d     6     5     8
e     6     6     6

In [105]:
df["var1"]

b    5
c    6
d    6
e    6
Name: var1, dtype: int32

In [106]:
df["var4"] = df["var1"] / df["var2"]

In [107]:
df

   var1  var2  var3  var4
b     5     1     1   5.0
c     6     3     2   2.0
d     6     5     8   1.2
e     6     6     6   1.0

In [108]:
#degisken silmek

In [109]:
df.drop("var4",axis=1,inplace=True)

In [110]:
df

   var1  var2  var3
b     5     1     1
c     6     3     2
d     6     5     8
e     6     6     6

In [111]:
l=["var1","var2"]

In [112]:
df.drop(l,axis=1)

   var3
b     1
c     2
d     8
e     6

**Gözlem ve Değişken Seçimi (loc & iloc)**

In [113]:
import numpy as np
import pandas as pd

In [115]:
m=np.random.randint(1,30,size=(10,3))
df=pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0    16    29    24
1    15     1    24
2    14    10    11
3    22    26     4
4    28    11    27
5     6     6    20
6    10    12    13
7    13    20    22
8    20    10    26
9    14    27    21

In [116]:
#loc:tanımlandığı şekli ile seçim yapmak için kullanılır.

In [117]:
df.loc[0:3]

   var1  var2  var3
0    16    29    24
1    15     1    24
2    14    10    11
3    22    26     4

In [118]:
#iloc:alışık olduğumuz indeksleme mantığı ile seçim yapar

In [119]:
df.iloc[0:3]

   var1  var2  var3
0    16    29    24
1    15     1    24
2    14    10    11

In [120]:
df.iloc[:3,:2]

   var1  var2
0    16    29
1    15     1
2    14    10

In [121]:
df.loc[0:3,"var3"]

0    24
1    24
2    11
3     4
Name: var3, dtype: int32

In [122]:
df.iloc[0:3] ["var3"]

0    24
1    24
2    11
Name: var3, dtype: int32

**Koşullu Eleman İşlemleri**

In [206]:
import numpy as np
import pandas as pd

In [207]:
m=np.random.randint(1,30,size=(10,3))
df=pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0     4    19    26
1    24    13    12
2    24    26    17
3    13     3     4
4     4    27    11
5    17    14    20
6     5    18     1
7    15    21    23
8    23    20     5
9     7     1    19

In [124]:
df["var1"]

0    11
1    27
2    24
3    22
4    24
5    24
6    12
7    26
8    17
9    25
Name: var1, dtype: int32

In [126]:
df[0:2] [["var1","var2"]]

   var1  var2
0    11     1
1    27    26

In [127]:
df

   var1  var2  var3
0    11     1    16
1    27    26    24
2    24     2    24
3    22    25    13
4    24     5    23
5    24    21    10
6    12     5    28
7    26    17    17
8    17     6    11
9    25    24     2

In [130]:
df[df.var1 > 15]

   var1  var2  var3
1    27    26    24
2    24     2    24
3    22    25    13
4    24     5    23
5    24    21    10
7    26    17    17
8    17     6    11
9    25    24     2

In [131]:
df[df.var1 > 15] ["var1"]

1    27
2    24
3    22
4    24
5    24
7    26
8    17
9    25
Name: var1, dtype: int32

In [136]:
df[(df.var1 > 20) & (df.var3 < 15)]

   var1  var2  var3
3    22    25    13
5    24    21    10
9    25    24     2

In [138]:
df.loc[(df.var1 > 15), ["var1","var2"]]

   var1  var2
1    27    26
2    24     2
3    22    25
4    24     5
5    24    21
7    26    17
8    17     6
9    25    24

In [139]:
df[(df.var1 > 20)] [["var1","var2"]]

   var1  var2
1    27    26
2    24     2
3    22    25
4    24     5
5    24    21
7    26    17
9    25    24

**Birleştirme (Join) İşlemleri**

In [4]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (5,3))
df1 = pd.DataFrame(m,columns=["var1","var2","var3"])
df1

   var1  var2  var3
0    28     1     1
1    26    23     1
2    11    22     2
3    14    19    23
4    24    19    19

In [31]:
df2=df1+10
df2

   var1  var2  var3
0    38    11    11
1    36    33    11
2    21    32    12
3    24    29    33
4    34    29    29

In [32]:
pd.concat([df1,df2])

   var1  var2  var3
0    28     1     1
1    26    23     1
2    11    22     2
3    14    19    23
4    24    19    19
0    38    11    11
1    36    33    11
2    21    32    12
3    24    29    33
4    34    29    29

In [8]:
?pd.concat

Signature:
pd.concat(
    objs: 'Iterable[NDFrame] | Mapping[Hashable, NDFrame]',
    axis: 'Axis' = 0,
    join: 'str' = 'outer',
    ignore_index: 'bool' = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool' = True,
) -> 'DataFrame | Series'
Docstring:
Concatenate pandas objects along a particular axis with optional set logic
along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned when `join`
    is 'outer'.
    This has no effect when ``join='inner'``, which already preserves
    the order of the non-concatenation axis.

    .. versionchanged:: 1.0.0

       Changed to not sort by default.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
Series.append : Concatenate Series.
DataFrame.append : Concatenate DataFrames.
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']
File:      c:\users\lenovo\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [9]:
pd.concat([df1,df2],ignore_index=True)

   var1  var2  var3
0    28     1     1
1    26    23     1
2    11    22     2
3    14    19    23
4    24    19    19
5    38    11    11
6    36    33    11
7    21    32    12
8    24    29    33
9    34    29    29

In [11]:
print(df1.columns)
print(df2.columns)

Index(['var1', 'var2', 'var3'], dtype='object')
Index(['var1', 'var2', 'var3'], dtype='object')

In [12]:
df2.columns=["var1","var2","deg3"]

In [13]:
df2

   var1  var2  deg3
0    38    11    11
1    36    33    11
2    21    32    12
3    24    29    33
4    34    29    29

In [14]:
df1

   var1  var2  var3
0    28     1     1
1    26    23     1
2    11    22     2
3    14    19    23
4    24    19    19

In [27]:
pd.concat([df1,df2],ignore_index=True)

   var1  var2  var3  deg3
0    28     1   1.0   NaN
1    26    23   1.0   NaN
2    11    22   2.0   NaN
3    14    19  23.0   NaN
4    24    19  19.0   NaN
5    38    11   NaN  11.0
6    36    33   NaN  11.0
7    21    32   NaN  12.0
8    24    29   NaN  33.0
9    34    29   NaN  29.0

In [20]:
pd.concat([df1,df2],join="inner") # kesişimlerine göre birleştirdi

   var1  var2
0    28     1
1    26    23
2    11    22
3    14    19
4    24    19
0    38    11
1    36    33
2    21    32
3    24    29
4    34    29

In [26]:
df3 = pd.concat([df1, df2], axis=1)
df3 = df3.reindex(df1.index)
df2

   var1  var2  deg3
0    38    11    11
1    36    33    11
2    21    32    12
3    24    29    33
4    34    29    29

**İleri Birleştirme İşlemleri**

In [231]:
import pandas as pd

In [232]:
# birebir birleştirme

In [233]:
df1 = pd.DataFrame({"calisanlar":["Ali","Ayse","Kemal","Deniz"],
                   "grup":["Muhasebe","Mühendislik","Mühendislik","İK"]})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Ayse  Mühendislik
2      Kemal  Mühendislik
3      Deniz           İK

In [234]:
df2 = pd.DataFrame({"calisanlar":["Ali","Ayse","Kemal","Deniz"],
                   "ilk_giris":[2010,2009,2014,2019]})
df2

  calisanlar  ilk_giris
0        Ali       2010
1       Ayse       2009
2      Kemal       2014
3      Deniz       2019

In [235]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Ayse  Mühendislik       2009
2      Kemal  Mühendislik       2014
3      Deniz           İK       2019

In [236]:
pd.merge(df1,df2, on = "calisanlar")

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Ayse  Mühendislik       2009
2      Kemal  Mühendislik       2014
3      Deniz           İK       2019

In [237]:
# çoktan teke birleştirme (many to one)

In [238]:
df3 = pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Ayse  Mühendislik       2009
2      Kemal  Mühendislik       2014
3      Deniz           İK       2019

In [239]:
df4 = pd.DataFrame({"grup":["Muhasebe","Mühendislik","İK"],
                   "mudur":["Caner","Mustafa","Ayhan"]})
df4

          grup    mudur
0     Muhasebe    Caner
1  Mühendislik  Mustafa
2           İK    Ayhan

In [240]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2010    Caner
1       Ayse  Mühendislik       2009  Mustafa
2      Kemal  Mühendislik       2014  Mustafa
3      Deniz           İK       2019    Ayhan

In [241]:
# many to many birleştirme

In [242]:
df5 = pd.DataFrame({"grup":["Muhasebe","Muhasebe","Mühendislik","Mühendislik","İK","İK"],
                   "yetenekler":["Matematik","Excel","Kodlama","Linux","Excel","Yonetim"]})

df5

          grup yetenekler
0     Muhasebe  Matematik
1     Muhasebe      Excel
2  Mühendislik    Kodlama
3  Mühendislik      Linux
4           İK      Excel
5           İK    Yonetim

In [243]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Ayse  Mühendislik
2      Kemal  Mühendislik
3      Deniz           İK

In [244]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  Matematik
1        Ali     Muhasebe      Excel
2       Ayse  Mühendislik    Kodlama
3       Ayse  Mühendislik      Linux
4      Kemal  Mühendislik    Kodlama
5      Kemal  Mühendislik      Linux
6      Deniz           İK      Excel
7      Deniz           İK    Yonetim

**Aggregation & Grouping İşlemleri**

In [36]:
 import seaborn as sns

In [37]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load an example dataset from the online repository (requires internet).

This function provides quick access to a small number of example datasets
that are useful for documenting seaborn or generating reproducible examples
for bug reports. It is not necessary for normal usage.

Note that some of the datasets have a small amount of preprocessing applied
to define a proper ordering for categorical variables.

Use :func:`get_dataset_names` to see a list of available datasets.

Parameters
----------
name : str
    Name of the dataset (``{name}.csv`` on
    https://github.com/mwaskom/seaborn-data).
cache : boolean, optional
    If True, try to load from the local cache first, and save to the cache
    if a download is required.
data_home : string, optional
    The directory in which to cache data; see :func:`get_data_home`.
kws : keys and values, optional
    Additional keyword arguments are passed to passed through to
    :func:`pandas.read_csv`.

Returns
-------
df : :class:`pandas.DataFrame`
    Tabular data, possibly with some preprocessing applied.
File:      c:\users\lenovo\anaconda3\lib\site-packages\seaborn\utils.py
Type:      function

In [39]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [40]:
df.shape

(1035, 6)

In [41]:
df.mean()

C:\Users\lenovo\AppData\Local\Temp\ipykernel_2792\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [42]:
df["mass"].mean()

2.6381605847953233

In [43]:
df["mass"].count()

513

In [44]:
df["year"].count()

1035

In [47]:
df["mass"].min()

0.0036

In [48]:
df["mass"].max()

25.0

In [49]:
df["mass"].sum()

1353.37638

In [50]:
df["mass"].std()

3.8186166509616046

In [51]:
df["mass"].var()

14.58183312700122

In [52]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [53]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [54]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

**Gruplama İşlemleri**

In [55]:
df = pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                  "veri":[90,51,34,13,77,21]},
                  columns=["gruplar","veri"])
df

  gruplar  veri
0       A    90
1       B    51
2       C    34
3       A    13
4       B    77
5       C    21

In [56]:
df.groupby("gruplar")

In [57]:
df.groupby("gruplar").mean()

         veri
gruplar
A        51.5
B        64.0
C        27.5

In [58]:
df.groupby("gruplar").sum()

         veri
gruplar
A         103
B         128
C          55

In [59]:
df_planets = sns.load_dataset("planets")
df_planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [60]:
df_planets.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [61]:
df_planets.groupby("method")["orbital_period"].describe().T

method,Astrometry,Eclipse Timing Variations,Imaging,Microlensing,Orbital Brightness Modulation,Pulsar Timing,Pulsation Timing Variations,Radial Velocity,Transit,Transit Timing Variations
count,2.000000,9.000000,12.000000,7.000000,3.000000,5.000000,1.0,553.00000,397.000000,3.000000
mean,631.180000,4751.644444,118247.737500,3153.571429,0.709307,7343.021201,1170.0,823.35468,21.102073,79.783500
std,544.217663,2499.130945,213978.177277,1113.166333,0.725493,16313.265573,NaN,1454.92621,46.185893,71.599884
min,246.360000,1916.250000,4639.150000,1825.000000,0.240104,0.090706,1170.0,0.73654,0.355000,22.339500
25%,438.770000,2900.000000,8343.900000,2375.000000,0.291496,25.262000,1170.0,38.02100,3.160630,39.675250
50%,631.180000,4343.500000,27500.000000,3300.000000,0.342887,66.541900,1170.0,360.20000,5.714932,57.011000
75%,823.590000,5767.000000,94250.000000,3550.000000,0.943908,98.211400,1170.0,982.00000,16.145700,108.505500
max,1016.000000,10220.000000,730000.000000,5100.000000,1.544929,36525.000000,1170.0,17337.50000,331.600590,160.000000

**İleri Toplulaştırma İşlemleri (Aggregate, filter, transform, apply)**

In [62]:
import pandas as pd
df = pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                  "DEG1":[10,20,30,12,23,55],
                  "DEG2":[111,132,565,232,56,23]},
                 columns=["gruplar","DEG1","DEG2"])
df

  gruplar  DEG1  DEG2
0       A    10   111
1       B    20   132
2       C    30   565
3       A    12   232
4       B    23    56
5       C    55    23

In [63]:
# aggregate

In [64]:
df.groupby("gruplar").mean()

         DEG1   DEG2
gruplar
A        11.0  171.5
B        21.5   94.0
C        42.5  294.0

In [65]:
df.groupby("gruplar").aggregate([min,np.median,max])

        DEG1            DEG2
         min median max  min median  max
gruplar
A         10   11.0  12  111  171.5  232
B         20   21.5  23   56   94.0  132
C         30   42.5  55   23  294.0  565

In [66]:
df.groupby("gruplar").aggregate({"DEG1":min,
                                 "DEG2":max
                                })

         DEG1  DEG2
gruplar
A          10   232
B          20   132
C          30   565

In [67]:
# filter

In [68]:
import pandas as pd
df = pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                  "DEG1":[10,20,30,12,23,55],
                  "DEG2":[111,132,565,232,56,23]},
                 columns=["gruplar","DEG1","DEG2"])
df

  gruplar  DEG1  DEG2
0       A    10   111
1       B    20   132
2       C    30   565
3       A    12   232
4       B    23    56
5       C    55    23

In [69]:
def filter_func(x):
    return x["DEG1"].std()>10
df.groupby("gruplar").std()

              DEG1        DEG2
gruplar
A         1.414214   85.559921
B         2.121320   53.740115
C        17.677670  383.251875

In [70]:
df.groupby("gruplar").filter(filter_func)

  gruplar  DEG1  DEG2
2       C    30   565
5       C    55    23

In [71]:
# transform

In [72]:
import pandas as pd
df = pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                  "DEG1":[10,20,30,12,23,55],
                  "DEG2":[111,132,565,232,56,23]},
                 columns=["gruplar","DEG1","DEG2"])
df

  gruplar  DEG1  DEG2
0       A    10   111
1       B    20   132
2       C    30   565
3       A    12   232
4       B    23    56
5       C    55    23

In [73]:
df["DEG1"]*9

0     90
1    180
2    270
3    108
4    207
5    495
Name: DEG1, dtype: int64

In [74]:
df_a = df.iloc[:,1:3]

In [75]:
df_a.transform(lambda x: (x-x.mean()) / x.std())

       DEG1      DEG2
0 -0.913548 -0.379627
1 -0.304516 -0.274035
2  0.304516  1.903161
3 -0.791741  0.228782
4 -0.121806 -0.656176
5  1.827096 -0.822105

In [76]:
# apply

In [98]:
import pandas as pd
df = pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                  "DEG1":[10,20,30,12,23,55],
                  "DEG2":[111,132,565,232,56,23]},
                 columns=["gruplar","DEG1","DEG2"])
df

  gruplar  DEG1  DEG2
0       A    10   111
1       B    20   132
2       C    30   565
3       A    12   232
4       B    23    56
5       C    55    23

In [94]:
df.apply(np.sum)

DEG1     150
DEG2    1119
dtype: int64

In [96]:
df.apply(np.mean)

DEG1     25.0
DEG2    186.5
dtype: float64

In [101]:
df.groupby("gruplar").apply(np.sum)

        gruplar  DEG1  DEG2
gruplar
A            AA    22   343
B            BB    43   188
C            CC    85   588

**Pivot Tablolar**

In [82]:
import numpy as np
import pandas as pd
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [83]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [84]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [85]:
# pivot ile table

In [86]:
titanic.pivot_table("survived",index="sex",columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [87]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [88]:
age = pd.cut(titanic["age"],[0,18,90])
age.head()

0    (18, 90]
1    (18, 90]
2    (18, 90]
3    (18, 90]
4    (18, 90]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [89]:
titanic.pivot_table("survived",["sex",age],"class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

**DIŞ KAYNAKLARDAN VERİ OKUMA**

In [102]:
import pandas as pd

In [103]:
?pd.read_csv

Signature:
pd.read_csv(
    filepath_or_buffer: 'FilePath | ReadCsvBuffer[bytes] | ReadCsvBuffer[str]',
    sep=<no_default>,
    delimiter=None,
    header='infer',
    names=<no_default>,
    index_col=None,
    usecols=None,
    squeeze=None,
    prefix=<no_default>,
    mangle_dupe_cols=True,
    dtype: 'DtypeArg | None' = None,
    engine: 'CSVEngine | None' = None,
    converters=None,
    true_values=None,
    false_values=None,
    skipinitialspace=False,
    skiprows=None,
    skipfooter=0,
    nrows=None,
    na_values=None,
    keep_default_na=True,
    na_filter=True,
    verbose=False,
    skip_blank_lines=True,
    parse_dates=None,
    infer_datetime_format=False,
    keep_date_col=False,
    date_parser=None,
    dayfirst=False,
    cache_dates=True,
    iterator=False,
    chunksize=None,
    compression: 'CompressionOptions' = 'infer',
    thousands=None,
    decimal: 'str' = '.',
    lineterminator=None,
    quotechar='"',
    quoting=0,
    doublequote=True,
    escapechar=None,
    comment=None,
    encoding=None,
    encoding_errors: 'str | None' = 'strict',
    dialect=None,
    error_bad_lines=None,
    warn_bad_lines=None,
    on_bad_lines=None,
    delim_whitespace=False,
    low_memory=True,
    memory_map=False,
    float_precision=None,
    storage_options: 'StorageOptions' = None,
)
Docstring:
Read a comma-separated values (csv) file into DataFrame.

Also supports optionally iterating or breaking of the file
into chunks.

Additional help can be found in the online docs for
`IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

Parameters
----------
filepath_or_buffer : str, path object or file-like object
    Any valid string path is acceptable. The string could be a URL. Valid
    URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
    expected. A local file could be: file://localhost/path/to/table.csv.

    If you want to pass in a path object, pandas accepts any ``os.PathLike``.

    By file-like object, we refer to objects with a ``read()`` method, such as
    a file handle (e.g. via builtin ``open`` function) or ``StringIO``.
sep : str, default ','
    Delimiter to use. If sep is None, the C engine cannot automatically detect
    the separator, but the Python parsing engine can, meaning the latter will
    be used and automatically detect the separator by Python's builtin sniffer
    tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
    different from ``'\s+'`` will be interpreted as regular expressions and
    will also force the use of the Python parsing engine. Note that regex
    delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``.
delimiter : str, default ``None``
    Alias for sep.
header : int, list of int, None, default 'infer'
    Row number(s) to use as the column names, and the start of the
    data.  Default behavior is to infer the column names: if no names
    are passed the behavior is identical to ``header=0`` and column
    names are inferred from the first line of the file, if column
    names are passed explicitly then the behavior is identical to
    ``header=None``. Explicitly pass ``header=0`` to be able to
    replace existing names. The header can be a list of integers that
    specify row locations for a multi-index on the columns
    e.g. [0,1,3]. Intervening rows that are not specified will be
    skipped (e.g. 2 in this example is skipped). Note that this
    parameter ignores commented lines and empty lines if
    ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
    data rather than the first line of the file.
names : array-like, optional
    List of column names to use. If the file contains a header row,
    then you should explicitly pass ``header=0`` to override the column names.
    Duplicates in this list are not allowed.
index_col : int, str, sequence of int / str, or False, optional, default ``None``
  Column(s) to use as the row labels of the ``DataFrame``, either given as
  string name or column index. If a sequence of int / str is given, a
  MultiIndex is used.

  Note: ``index_col=False`` can be used to force pandas to *not* use the first
  column as the index, e.g. when you have a malformed file with delimiters at
  the end of each line.
usecols : list-like or callable, optional
    Return a subset of the columns. If list-like, all elements must either
    be positional (i.e. integer indices into the document columns) or strings
    that correspond to column names provided either by the user in `names` or
    inferred from the document header row(s). If ``names`` are given, the document
    header row(s) are not taken into account. For example, a valid list-like
    `usecols` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
    Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
    To instantiate a DataFrame from ``data`` with element order preserved use
    ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
    in ``['foo', 'bar']`` order or
    ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
    for ``['bar', 'foo']`` order.

    If callable, the callable function will be evaluated against the column
    names, returning names where the callable function evaluates to True. An
    example of a valid callable argument would be ``lambda x: x.upper() in
    ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
    parsing time and lower memory usage.
squeeze : bool, default False
    If the parsed data only contains one column then return a Series.

    .. deprecated:: 1.4.0
        Append ``.squeeze("columns")`` to the call to ``read_csv`` to squeeze
        the data.
prefix : str, optional
    Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...

    .. deprecated:: 1.4.0
       Use a list comprehension on the DataFrame's columns after calling ``read_csv``.
mangle_dupe_cols : bool, default True
    Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
    'X'...'X'. Passing in False will cause data to be overwritten if there
    are duplicate names in the columns.
dtype : Type name or dict of column -> type, optional
    Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32,
    'c': 'Int64'}
    Use `str` or `object` together with suitable `na_values` settings
    to preserve and not interpret dtype.
    If converters are specified, they will be applied INSTEAD
    of dtype conversion.
engine : {'c', 'python', 'pyarrow'}, optional
    Parser engine to use. The C and pyarrow engines are faster, while the python engine
    is currently more feature-complete. Multithreading is currently only supported by
    the pyarrow engine.

    .. versionadded:: 1.4.0

        The "pyarrow" engine was added as an *experimental* engine, and some features
        are unsupported, or may not work correctly, with this engine.
converters : dict, optional
    Dict of functions for converting values in certain columns. Keys can either
    be integers or column labels.
true_values : list, optional
    Values to consider as True.
false_values : list, optional
    Values to consider as False.
skipinitialspace : bool, default False
    Skip spaces after delimiter.
skiprows : list-like, int or callable, optional
    Line numbers to skip (0-indexed) or number of lines to skip (int)
    at the start of the file.

    If callable, the callable function will be evaluated against the row
    indices, returning True if the row should be skipped and False otherwise.
    An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
skipfooter : int, default 0
    Number of lines at bottom of file to skip (Unsupported with engine='c').
nrows : int, optional
    Number of rows of file to read. Useful for reading pieces of large files.
na_values : scalar, str, list-like, or dict, optional
    Additional strings to recognize as NA/NaN. If dict passed, specific
    per-column NA values.  By default the following values are interpreted as
    NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
    '1.#IND', '1.#QNAN', '<NA>', 'N/A', 'NA', 'NULL', 'NaN', 'n/a',
    'nan', 'null'.
keep_default_na : bool, default True
    Whether or not to include the default NaN values when parsing the data.
    Depending on whether `na_values` is passed in, the behavior is as follows:

    * If `keep_default_na` is True, and `na_values` are specified, `na_values`
      is appended to the default NaN values used for parsing.
    * If `keep_default_na` is True, and `na_values` are not specified, only
      the default NaN values are used for parsing.
    * If `keep_default_na` is False, and `na_values` are specified, only
      the NaN values specified `na_values` are used for parsing.
    * If `keep_default_na` is False, and `na_values` are not specified, no
      strings will be parsed as NaN.

    Note that if `na_filter` is passed in as False, the `keep_default_na` and
    `na_values` parameters will be ignored.
na_filter : bool, default True
    Detect missing value markers (empty strings and the value of na_values). In
    data without any NAs, passing na_filter=False can improve the performance
    of reading a large file.
verbose : bool, default False
    Indicate number of NA values placed in non-numeric columns.
skip_blank_lines : bool, default True
    If True, skip over blank lines rather than interpreting as NaN values.
parse_dates : bool or list of int or names or list of lists or dict, default False
    The behavior is as follows:

    * boolean. If True -> try parsing the index.
    * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
      each as a separate date column.
    * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
      a single date column.
    * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
      result 'foo'

    If a column or index cannot be represented as an array of datetimes,
    say because of an unparsable value or a mixture of timezones, the column
    or index will be returned unaltered as an object data type. For
    non-standard datetime parsing, use ``pd.to_datetime`` after
    ``pd.read_csv``. To parse an index or column with a mixture of timezones,
    specify ``date_parser`` to be a partially-applied
    :func:`pandas.to_datetime` with ``utc=True``. See
    :ref:`io.csv.mixed_timezones` for more.

    Note: A fast-path exists for iso8601-formatted dates.
infer_datetime_format : bool, default False
    If True and `parse_dates` is enabled, pandas will attempt to infer the
    format of the datetime strings in the columns, and if it can be inferred,
    switch to a faster method of parsing them. In some cases this can increase
    the parsing speed by 5-10x.
keep_date_col : bool, default False
    If True and `parse_dates` specifies combining multiple columns then
    keep the original columns.
date_parser : function, optional
    Function to use for converting a sequence of string columns to an array of
    datetime instances. The default uses ``dateutil.parser.parser`` to do the
    conversion. Pandas will try to call `date_parser` in three different ways,
    advancing to the next if an exception occurs: 1) Pass one or more arrays
    (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
    string values from the columns defined by `parse_dates` into a single array
    and pass that; and 3) call `date_parser` once for each row using one or
    more strings (corresponding to the columns defined by `parse_dates`) as
    arguments.
dayfirst : bool, default False
    DD/MM format dates, international and European format.
cache_dates : bool, default True
    If True, use a cache of unique, converted dates to apply the datetime
    conversion. May produce significant speed-up when parsing duplicate
    date strings, especially ones with timezone offsets.

    .. versionadded:: 0.25.0
iterator : bool, default False
    Return TextFileReader object for iteration or getting chunks with
    ``get_chunk()``.

    .. versionchanged:: 1.2

       ``TextFileReader`` is a context manager.
chunksize : int, optional
    Return TextFileReader object for iteration.
    See the `IO Tools docs
    <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
    for more information on ``iterator`` and ``chunksize``.

    .. versionchanged:: 1.2

       ``TextFileReader`` is a context manager.
compression : str or dict, default 'infer'
    For on-the-fly decompression of on-disk data. If 'infer' and '%s' is
    path-like, then detect compression from the following extensions: '.gz',
    '.bz2', '.zip', '.xz', or '.zst' (otherwise no compression). If using
    'zip', the ZIP file must contain only one data file to be read in. Set to
    ``None`` for no decompression. Can also be a dict with key ``'method'`` set
    to one of {``'zip'``, ``'gzip'``, ``'bz2'``, ``'zstd'``} and other
    key-value pairs are forwarded to ``zipfile.ZipFile``, ``gzip.GzipFile``,
    ``bz2.BZ2File``, or ``zstandard.ZstdDecompressor``, respectively. As an
    example, the following could be passed for Zstandard decompression using a
    custom compression dictionary:
    ``compression={'method': 'zstd', 'dict_data': my_compression_dict}``.

    .. versionchanged:: 1.4.0 Zstandard support.

thousands : str, optional
    Thousands separator.
decimal : str, default '.'
    Character to recognize as decimal point (e.g. use ',' for European data).
lineterminator : str (length 1), optional
    Character to break file into lines. Only valid with C parser.
quotechar : str (length 1), optional
    The character used to denote the start and end of a quoted item. Quoted
    items can include the delimiter and it will be ignored.
quoting : int or csv.QUOTE_* instance, default 0
    Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
    QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
doublequote : bool, default ``True``
   When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
   whether or not to interpret two consecutive quotechar elements INSIDE a
   field as a single ``quotechar`` element.
escapechar : str (length 1), optional
    One-character string used to escape other characters.
comment : str, optional
    Indicates remainder of line should not be parsed. If found at the beginning
    of a line, the line will be ignored altogether. This parameter must be a
    single character. Like empty lines (as long as ``skip_blank_lines=True``),
    fully commented lines are ignored by the parameter `header` but not by
    `skiprows`. For example, if ``comment='#'``, parsing
    ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
    treated as the header.
encoding : str, optional
    Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
    standard encodings
    <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .

    .. versionchanged:: 1.2

       When ``encoding`` is ``None``, ``errors="replace"`` is passed to
       ``open()``. Otherwise, ``errors="strict"`` is passed to ``open()``.
       This behavior was previously only the case for ``engine="python"``.

    .. versionchanged:: 1.3.0

       ``encoding_errors`` is a new argument. ``encoding`` has no longer an
       influence on how encoding errors are handled.

encoding_errors : str, optional, default "strict"
    How encoding errors are treated. `List of possible values
    <https://docs.python.org/3/library/codecs.html#error-handlers>`_ .

    .. versionadded:: 1.3.0

dialect : str or csv.Dialect, optional
    If provided, this parameter will override values (default or not) for the
    following parameters: `delimiter`, `doublequote`, `escapechar`,
    `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
    override values, a ParserWarning will be issued. See csv.Dialect
    documentation for more details.
error_bad_lines : bool, optional, default ``None``
    Lines with too many fields (e.g. a csv line with too many commas) will by
    default cause an exception to be raised, and no DataFrame will be returned.
    If False, then these "bad lines" will be dropped from the DataFrame that is
    returned.

    .. deprecated:: 1.3.0
       The ``on_bad_lines`` parameter should be used instead to specify behavior upon
       encountering a bad line instead.
warn_bad_lines : bool, optional, default ``None``
    If error_bad_lines is False, and warn_bad_lines is True, a warning for each
    "bad line" will be output.

    .. deprecated:: 1.3.0
       The ``on_bad_lines`` parameter should be used instead to specify behavior upon
       encountering a bad line instead.
on_bad_lines : {'error', 'warn', 'skip'} or callable, default 'error'
    Specifies what to do upon encountering a bad line (a line with too many fields).
    Allowed values are :

        - 'error', raise an Exception when a bad line is encountered.
        - 'warn', raise a warning when a bad line is encountered and skip that line.
        - 'skip', skip bad lines without raising or warning when they are encountered.

    .. versionadded:: 1.3.0

    .. versionadded:: 1.4.0

        - callable, function with signature
          ``(bad_line: list[str]) -> list[str] | None`` that will process a single
          bad line. ``bad_line`` is a list of strings split by the ``sep``.
          If the function returns ``None``, the bad line will be ignored.
          If the function returns a new list of strings with more elements than
          expected, a ``ParserWarning`` will be emitted while dropping extra elements.
          Only supported when ``engine="python"``

delim_whitespace : bool, default False
    Specifies whether or not whitespace (e.g. ``' '`` or ``'    '``) will be
    used as the sep. Equivalent to setting ``sep='\s+'``. If this option
    is set to True, nothing should be passed in for the ``delimiter``
    parameter.
low_memory : bool, default True
    Internally process the file in chunks, resulting in lower memory use
    while parsing, but possibly mixed type inference.  To ensure no mixed
    types either set False, or specify the type with the `dtype` parameter.
    Note that the entire file is read into a single DataFrame regardless,
    use the `chunksize` or `iterator` parameter to return the data in chunks.
    (Only valid with C parser).
memory_map : bool, default False
    If a filepath is provided for `filepath_or_buffer`, map the file object
    directly onto memory and access the data directly from there. Using this
    option can improve performance because there is no longer any I/O overhead.
float_precision : str, optional
    Specifies which converter the C engine should use for floating-point
    values. The options are ``None`` or 'high' for the ordinary converter,
    'legacy' for the original lower precision pandas converter, and
    'round_trip' for the round-trip converter.

    .. versionchanged:: 1.2

storage_options : dict, optional
    Extra options that make sense for a particular storage connection, e.g.
    host, port, username, password, etc. For HTTP(S) URLs the key-value pairs
    are forwarded to ``urllib`` as header options. For other URLs (e.g.
    starting with "s3://", and "gcs://") the key-value pairs are forwarded to
    ``fsspec``. Please see ``fsspec`` and ``urllib`` for more details.

    .. versionadded:: 1.2

Returns
-------
DataFrame or TextParser
    A comma-separated values (csv) file is returned as two-dimensional
    data structure with labeled axes.

See Also
--------
DataFrame.to_csv : Write DataFrame to a comma-separated values (csv) file.
read_csv : Read a comma-separated values (csv) file into DataFrame.
read_fwf : Read a table of fixed-width formatted lines into DataFrame.

Examples
--------

In [117]:
# csv okuma
df=pd.read_csv('titanic.csv',sep=";")
df.head()

   survived  pclass   age  sibsp  parch     fare
0         0       3  22.0      1      0   72.500
1         1       1  38.0      1      0  712.833
2         1       3  26.0      0      0   79.250
3         1       1  35.0      1      0  531.000
4         0       3  35.0      0      0   80.500

In [ ]:
# txt okuma
pd.read_csv("duz_metin.txt")

In [ ]:
df = pd.read_excel("ornekx.xlsx")

In [ ]:
# sıfırdan txt okuma
tips = pd.read_csv("data.txt")
tips.head()